---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputPoints
source: html/1b74c240-55f5-c1ab-1e78-57bba4090a66.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputPoints Method

Returns a list of additional points defining certain connections.

## Syntax (C#)
```csharp
public IList<ConnectionInputPoint> GetInputPoints()
```